{
    "title": "Memorial for Tim Helmers",
    "description": "A tribute to the life and memory of Tim Helmers",
    "name": "Timothy Patrick Helmers",
    "birthdate": "October 11, 1987",
    "passingdate": "June 22, 2024",
    "bio": "Tim Helmers was born in Plano, Illinois on October 11, 1987, to Patrick and Denise Helmers. He was a person who lived life with a deep sense of service and adventure. As a proud Boy Scout, Tim embodied the values of Scouting America throughout his life. From 2002 to 2008, he spent his summers as a camp counselor at Camp Robert Drake in Fairmount, Illinois, where he met his lifelong friends, David and Joshua Stack. Tim's commitment to service continued with his enlistment in the Coast Guard, serving as a Gunner's Mate from 2007 until 2010. In 2014, he graduated from Trinidad State College as a certified gunsmith, and in 2019, he earned a bachelor's degree in parks and recreation from Aurora University. At the time of his passing, Tim was a facilities maintainer with the Parkrose School District in Portland, Oregon. He was known for his contributions, home-baked cookies, and his role in the school district's wellness committee. Tim's love for the outdoors and scouting activities like cooking, gunsmithing, archery, and camping was unparalleled. He was also a creative and thoughtful gift-giver. Tim spent pivotal years with his uncle, Craig Joseph Dienberg, in Washington, cherishing the wisdom and kindness Craig imparted on him. Tim adored being an uncle to James, Zoe, and Kai Helmers, finding genuine joy in their company. He is survived by his parents, Pat and Denise Helmers, and his brothers, Michael, John, and Christopher. Tim is fondly remembered by his many cousins, aunts, uncles, and dear friend Ashley Porter. A Festival of Remembrance will be held at 2 p.m., Saturday, July 6th, at the Helmers Homestead in Plano, IL.",
    "lifeEvents": [
      {
        "year": "2002",
        "description": "Started working as a camp counselor at Camp Robert Drake."
      },
      {
        "year": "2007",
        "description": "Enlisted in the Coast Guard as a Gunner's Mate."
      },
      {
        "year": "2014",
        "description": "Graduated from Trinidad State College as a certified gunsmith."
      },
      {
        "year": "2019",
        "description": "Graduated from Aurora University with a degree in parks and recreation."
      }
    ],
    "photos": [
      "images/00100lPORTRAIT_00100_BURST20191026185627071_COVER.jpg",
      "images/2012-12-24_14-35-33_482.jpg",
      "images/2023-06-06(1).jpg",
      "images/2023-06-06(2).jpg",
      "images/2023-06-06(3).jpg",
      "images/2023-06-06(4).jpg",
      "images/2023-06-06.jpg",
      "images/DSC00011.JPG",
      "images/IMG_20170725_223740.jpg",
      "images/KM_20160130_0082.jpg",
      "images/PXL_20220605_144849391.jpg",
      "images/PXL_20231224_033956952.jpg"
    ],
    "tributes": [
      {
        "name": "Nguyen T.",
        "message": "I first met Tim at John and Colleen's wedding. My first impression of him was his quietness and the maturity of a big brother, yet he was always there for his family and having fun with them. He was also present at our wedding, and I wish I could talk to him more. Tim, you will be missed deeply, and I hope you rest in peace."
      },
      {
        "name": "John M.",
        "message": "Tim always seemed to enjoy being a Boy Scout in Troop 71 and was always willing to give a helping hand. So sorry for your loss."
      },
      {
        "name": "Colleen H.",
        "message": "Tim taught me it’s not how you answer the question, it’s about how long you're willing to have the conversation."
      },
      {
        "name": "Zac R.",
        "message": "I’m so sorry to hear this! Tim was one of the nicest, most genuine human beings you will ever meet. I was lucky to have him in my patrol multiple times. My condolences are with the entire Helmers Family!"
      },
      {
        "name": "Lori D.",
        "message": "He will be missed. Such an extraordinary person. Donald loved the conversations he had with Tim. I cannot imagine what you are going thru now but please let us know if there is anything we can do to help💔"
      },
      {
        "name": "Kevin D.",
        "message": "My deepest condolences to you and your family. Many fond memories of working with Tim and John out at Camp Drake. He will be sorely missed."
      },
      {
        "name": "John M.",
        "message": "This is John from Parkrose Sacramento elementary. This last year I got to know him. He was always so helpful and reliable for me. I too am shocked. I am so sorry."
      }
    ],
    "donations": [
      {
        "name": "Camp Robert Drake",
        "url": "https://camprobertdrake.org"
      },
      {
        "name": "Charity of Your Choice",
        "url": "https://charityofyourchoice.org"
      }
    ]
  }
  